package com.kuky.base.kotlin.demo.mvp

/**
 * @author kuky.
 * @description
 */
class MvpModel : IMvpModel {
    override fun getChangeList(): Array<String> = arrayOf(
            "今夕何夕兮，搴舟中流。\n" +
                    "今日何日兮，得与王子同舟。\n" +
                    "蒙羞被好兮，不訾诟耻。\n" +
                    "心几烦而不绝兮，得知王子。\n" +
                    "山有木兮木有枝，心悦君兮君不知。",
            "皑如山上雪，皎若云间月。\n" +
                    "闻君有两意，故来相决绝。\n" +
                    "今日斗酒会，明旦沟水头。\n" +
                    "躞蹀御沟上，沟水东西流。\n" +
                    "凄凄复凄凄，嫁娶不须啼。\n" +
                    "愿得一心人，白头不相离。\n" +
                    "竹竿何袅袅，鱼尾何簁簁！\n" +
                    "男儿重意气，何用钱刀为！",
            "有美一人兮，见之不忘。\n" +
                    "一日不见兮，思之如狂。\n" +
                    "凤飞翱翔兮，四海求凰。\n" +
                    "无奈佳人兮，不在东墙。\n" +
                    "将琴代语兮，聊写衷肠。\n" +
                    "何时见许兮，慰我彷徨。\n" +
                    "愿言配德兮，携手相将。\n" +
                    "不得於飞兮，使我沦亡。",
            "凤兮凤兮归故乡，遨游四海求其凰。\n" +
                    "时未遇兮无所将，何悟今兮升斯堂！\n" +
                    "有艳淑女在闺房，室迩人遐毒我肠。\n" +
                    "何缘交颈为鸳鸯，胡颉颃兮共翱翔！\n" +
                    "凰兮凰兮从我栖，得托孳尾永为妃。\n" +
                    "交情通意心和谐，中夜相从知者谁？\n" +
                    "双翼俱起翻高飞，无感我思使余悲。",
            "绿杨芳草长亭路，年少抛人容易去。\n" +
                    "楼头残梦五更钟，花底离愁三月雨。\n" +
                    "无情不似多情苦，一寸还成千万缕。\n" +
                    "天涯地角有穷时，只有相思无尽处。",
            "我住长江头，君住长江尾。\n" +
                    "日日思君不见君，共饮长江水。\n" +
                    "此水几时休，此恨何时已。\n" +
                    "只愿君心似我心，定不负相思意。",
            "长相思，长相思。\n" +
                    "若问相思甚了期，除非相见时。\n" +
                    "长相思，长相思。\n" +
                    "欲把相思说似谁，浅情人不知。",
            "明月照高楼，流光正徘徊。\n" +
                    "上有愁思妇，悲叹有余哀。\n" +
                    "借问叹者谁？言是宕子妻。\n" +
                    "君行逾十年，孤妾常独栖。\n" +
                    "君若清路尘，妾若浊水泥。\n" +
                    "浮沉各异势，会合何时谐？\n" +
                    "愿为西南风，长逝入君怀。\n" +
                    "君怀良不开，贱妾当何依？"
    )
}